thinkin
back
in
time
when
love
was
only
my
mind
i
realize
aint
no
second
chance
youve
got
to
hold
on
romance
dont
let
it
slide
theres
a
special
kind
of
magic
the
air
you
find
another
heart
that
needs
share
baby
come
me
put
arms
around
this
meant
be
and
im
oh
so
glad
found
need
evry
day
gotta
have
your
always
stay
cause
cant
go
livin
without
spendin
dime
keep
talkin
line
thats
how
all
those
walks
together
out
any
weather
just
because
brandnew
way
looking
at
life
know
is
standing
by
side
nights
can
cold
chill
evenin
youre
alone
talk
anymore
ill
here
warm
darling
hey
want
they
told
him
ever
wanna
see
face
better
disappear
fires
their
eyes
words
are
really
clear
beat
run
do
what
blood
macho
man
tough
but
bad
one
wants
defeated
showin
funky
strong
fight
doesnt
matter
whos
wrong
or
right
uh
theyre
get
leave
while
boy
alive
show
them
not
scared
playin
with
truth
dare
theyll
kick
then
tell
its
fair
she
more
like
beauty
queen
from
movie
scene
said
mean
am
who
will
dance
floor
round
her
name
billie
jean
as
caused
every
head
turned
dreamed
being
people
careful
breaking
young
girls
hearts
mother
lie
becomes
lover
shes
girl
claims
kid
son
says
for
forty
days
law
stand
demand
schemes
plans
we
danced
take
advice
remember
think
twice
wed
til
three
looked
showed
photo
cried
his
were
mine
came
stood
smell
sweet
perfume
happened
much
too
soon
called
room
did
he
babe
eileen
poor
old
johnnie
ray
sounded
sad
upon
radio
moved
million
mono
our
mothers
sang
along
whod
blame
grown
up
now
must
say
than
tooraloora
tooralooryeay
sing
fathers
swear
means
moment
everything
dress
thoughts
confess
verge
dirty
ah
these
beaten
down
sunk
smokedried
resigned
fate
us
never
far
clever
youll
hum
tune
forever
lets
off
pretty
red
yes
please
full
toora
shown
taloora
things
real
talooryeay
feel
changed
well
whoa
believe
if
endearing
chums
gaze
fondly
today
suddenly
fly
night
fairy
gifts
gone
sky
give
crime
steal
inside
hurt
make
cry
precious
kisses
burn
lovers
ask
why
fire
burning
choose
color
star
step
few
spoken
could
waste
thousand
years
wrapped
sorrow
token
catch
tears
been
talking
true
loves
reason
prepared
away
everythings
over
again
traveling
friedout
kombi
hippie
trail
zombie
met
strange
lady
made
nervous
took
gave
breakfast
land
under
where
women
glow
men
plunder
hear
thunder
cover
buying
bread
brussels
sixfootfour
muscle
speaka
language
smiled
vegemite
sandwich
beer
does
flow
chunder
yeah
lying
den
bombay
slack
jaw
trying
tempt
plenty
yeahyeah
living
betterbetter
ooh
breath
move
bond
break
watching
single
word
game
play
belong
aches
vow
smile
fake
claim
stake
since
ive
lost
trace
dream
look
replace
long
embrace
crying
whoo
hoo
first
nothing
slow
glowing
fear
seems
hide
deep
silent
pride
world
steel
stone
music
close
rhythm
wrap
feeling
beings
believin
dancing
passion
happen
pictures
through
flash
takes
call
darken
city
wire
steam
subway
earth
afire
dododododododododo
woman
sign
breathing
even
closer
behind
touch
ground
hunt
after
sound
crowd
hungry
wolf
straddle
discord
rhyme
mouth
juices
wine
stalked
forest
moonlight
high
drumming
skin
tight
heat
scent
strut
howl
whine
running
wont
grow
holding
something
deny
home
has
anyway
going
before
good
thing
an
end
hard
losing
friend
whats
pretend
shoes
blues
song
sway
lights
empty
space
would
two
should
fall
into
tremble
flower
grace
tonight
serious
shell
lean
type
new
seen
waiting
sitting
door
many
paid
getting
free
wild
shecat
tamed
purr
jaguar
moneys
gonna
comes
watch
chew
maneater
wouldnt
deadly
rip
apart
there
beast
town
saturday
lookin
realtime
sees
crazy
locking
rhythms
changing
movement
light
danger
zone
dancer
cut
knife
gift
between
maniac
iceblue
insanity
place
most
hardwon
mystery
work
pass
pushshove
hunger
stays
kinetic
struggling
stretching
stopping
against
wind
sure
regret
forgiven
loved
intend
open
try
times
body
had
granted
some
left
flickers
still
shines
about
chances
wait
sweeter
dedicate
myself
giving
until
beside
cries
easy
nightmares
feels
once
womans
heaven
opens
angels
tread
midnight
shame
moon
everywhere
comfort
strangers
faces
laughing
loud
goin
toes
knows
works
money
honey
treat
onetta
corner
wonders
seem
nine
hour
hand
bell
clientele
twentyeight
lot
ones
sacrifice
working
little
tips
pay
worth
care
already
sell
dollar
bill
alright
dreams
disagree
travel
seven
seas
everybodys
use
used
abuse
abused
movin
turn
bit
lonely
coming
tired
listening
best
terrified
bright
restless
helpless
child
angry
making
shadow
dark
powder
keg
sparks
forevers
start
falling
total
eclipse
road
next
stop
twilight
sittin
waitin
gun
maybe
connection
takin
storm
loose
sirens
silence
circuits
dead
cannot
decode
whole
spins
frenzy
help
steppin
madhouse
cloned
beacons
bullet
hits
bone
spiral
destination
unknown
doublecrossed
messenger
weighs
heavy
guilty
borderline
hit
damn
cheated
sharing
build
treasure
promises
reward
trust
each
other
therell
comeoneileentxt
00
05787297259959933
1606524148523171
14760282429871585
17369655941662063
34739311883324127
014800116288755355
18351316984814148
023446525363702297
03929222965490682
22280125252694414
4070675118859409
115200309344505
345600928033515
024582461053608246
46080123737802
3321928094887362
2643856189774725
08624964762500651
33219280948873626
17249929525001302
2977884797270224
04150374992788437
06214883767462703
30291463456595165
6643856189774725
6002097054654746
20
13219280948873624
23040061868901
3584962500721156
14739311883324124
5473931188332412
2736965594166206
2321928094887362
39151148563631875
4643856189774724
40
8587059555375903
15145731728297582
5770074807113441
238
